In [82]:
import pandas as pd

with open('whats_app.txt', encoding="utf8") as f:
    content = f.readlines()
# you may also want to remove whitespace characters like `\n` at the end of each line

content = [x.strip() for x in content]

In [83]:
data = content[2:]

In [84]:
df = [x.split(' - ')[1] if ' - ' in x else '' for x in data]
df = [x.split(': ')[0] for x in df]
df = [x if 'joined using this' not in x else '' for x in df]
df = [x if ' added ' not in x else '' for x in df]
df = [x if ' deleted ' not in x else '' for x in df]
df = [x if ' changed to ' not in x else '' for x in df]
df = [x if ' left' not in x else '' for x in df]

pddf = pd.DataFrame({'name':df})
pddf = pddf[pddf.name != '']
pddf['counter'] = 1 

cnt = pddf.groupby(by = ['name']).sum()
cnt[cnt.counter > 1].to_csv('output.csv')
#cnt[cnt.counter > 1].count() #head(20)

In [48]:
import pandas as pd

data = {'Country': ['Belgium',  'India',  'Brazil', 'UK', 'UK'],
        'Capital': ['Brussels',  'New Delhi',  'Brasilia', 'London', 'Manchester'],
        'Population': [11190846, 1303171035, 207847528, 12345, 45678]}

df = pd.DataFrame(data,columns=['Country',  'Capital',  'Population'])

In [49]:
df

   Country     Capital  Population
0  Belgium    Brussels    11190846
1    India   New Delhi  1303171035
2   Brazil    Brasilia   207847528
3       UK      London       12345
4       UK  Manchester       45678

In [50]:
country = df.groupby('Country').sum()
country.reset_index(level=0, inplace=True)

dt = df.groupby(['Country', 'Capital']).sum()
dt.reset_index(level=0, inplace=True)
dt.reset_index(level=0, inplace=True)

In [51]:
pd.merge(dt, country, how = 'inner', on = 'Country').sum()['Population_x']

1522267432

In [61]:
mdf = pd.melt(df, id_vars = 'Population')
mdf.pivot(columns = 'variable', values = 'value')

variable     Capital  Country
0                NaN  Belgium
1                NaN    India
2                NaN   Brazil
3                NaN       UK
4                NaN       UK
5           Brussels      NaN
6          New Delhi      NaN
7           Brasilia      NaN
8             London      NaN
9         Manchester      NaN

In [67]:
tmp = mdf.filter(regex='^var')  
tmp.drop_duplicates()

  variable
0  Country
5  Capital

In [70]:
tmp.rename(columns = {'variable':'var'})

       var
0  Country
1  Country
2  Country
3  Country
4  Country
5  Capital
6  Capital
7  Capital
8  Capital
9  Capital

In [71]:
tmp

  variable
0  Country
1  Country
2  Country
3  Country
4  Country
5  Capital
6  Capital
7  Capital
8  Capital
9  Capital

In [40]:
country

   Country  Population
0  Belgium    11190846
1   Brazil   207847528
2    India  1303171035
3       UK       58023